In [1]:
import pandas as pd
import numpy as np

In [4]:
data=np.random.randn(4,3)

In [5]:
data

array([[ 0.65609218, -0.7546991 ,  0.31598268],
       [ 1.20623067,  1.57491599,  0.24456979],
       [-0.38015155, -2.27539901,  1.51352519],
       [ 0.413782  ,  0.45096426, -0.24182535]])

In [6]:
dataFrame=pd.DataFrame(data)

In [7]:
dataFrame

          0         1         2
0  0.656092 -0.754699  0.315983
1  1.206231  1.574916  0.244570
2 -0.380152 -2.275399  1.513525
3  0.413782  0.450964 -0.241825

In [8]:
dataFrame[0]

0    0.656092
1    1.206231
2   -0.380152
3    0.413782
Name: 0, dtype: float64

In [9]:
yeniDataFrame=pd.DataFrame(data, index=["Yalcin","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [10]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Yalcin  0.656092 -0.754699       0.315983
Zeynep  1.206231  1.574916       0.244570
Atlas  -0.380152 -2.275399       1.513525
Mehmet  0.413782  0.450964      -0.241825

In [11]:
yeniDataFrame['Yas']

Yalcin   -0.754699
Zeynep    1.574916
Atlas    -2.275399
Mehmet    0.450964
Name: Yas, dtype: float64

In [13]:
yeniDataFrame["Calisma Saati"]

Yalcin    0.315983
Zeynep    0.244570
Atlas     1.513525
Mehmet   -0.241825
Name: Calisma Saati, dtype: float64

In [14]:
yeniDataFrame[["Yas","Maas"]]

             Yas      Maas
Yalcin -0.754699  0.656092
Zeynep  1.574916  1.206231
Atlas  -2.275399 -0.380152
Mehmet  0.450964  0.413782

In [15]:
yeniDataFrame.loc["Yalcin"]

Maas             0.656092
Yas             -0.754699
Calisma Saati    0.315983
Name: Yalcin, dtype: float64

In [18]:
#kolonları direkt df["kolonadi"] ile çekebiliyoruz ama satırları .loc yada iloc ile
yeniDataFrame.loc['Zeynep']

Maas             1.206231
Yas              1.574916
Calisma Saati    0.244570
Name: Zeynep, dtype: float64

In [19]:
yeniDataFrame.iloc[1]

Maas             1.206231
Yas              1.574916
Calisma Saati    0.244570
Name: Zeynep, dtype: float64

In [20]:
yeniDataFrame["Emeklilik Yasi"]=yeniDataFrame["Yas"]+yeniDataFrame["Yas"]

In [21]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Yalcin  0.656092 -0.754699       0.315983       -1.509398
Zeynep  1.206231  1.574916       0.244570        3.149832
Atlas  -0.380152 -2.275399       1.513525       -4.550798
Mehmet  0.413782  0.450964      -0.241825        0.901929

In [24]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1) #axis1 sutun axis0 satır

            Maas       Yas  Calisma Saati
Yalcin  0.656092 -0.754699       0.315983
Zeynep  1.206231  1.574916       0.244570
Atlas  -0.380152 -2.275399       1.513525
Mehmet  0.413782  0.450964      -0.241825

In [30]:
yeniDataFrame.drop("Mehmet",axis=0,inplace=True) #inplace=True yapılan değişiklikleri kaydeder.

In [31]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Yalcin  0.656092 -0.754699       0.315983       -1.509398
Zeynep  1.206231  1.574916       0.244570        3.149832
Atlas  -0.380152 -2.275399       1.513525       -4.550798

In [32]:
yeniDataFrame.loc["Yalcin"]

Maas              0.656092
Yas              -0.754699
Calisma Saati     0.315983
Emeklilik Yasi   -1.509398
Name: Yalcin, dtype: float64

In [33]:
yeniDataFrame.loc["Yalcin"]["Yas"]
#veya yeniDataFrame.loc["Yalcin","Yas"]

-0.7546990981665295

In [34]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Yalcin       NaN -0.754699            NaN       -1.509398
Zeynep       NaN       NaN            NaN             NaN
Atlas  -0.380152 -2.275399            NaN       -4.550798

In [35]:
yeniDataFrame[yeniDataFrame["Yas"]> 0]

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Zeynep  1.206231  1.574916        0.24457        3.149832

In [36]:
yeniDataFrame.reset_index() #indexleri reseler 0,1,2 gibi atama yapar

    index      Maas       Yas  Calisma Saati  Emeklilik Yasi
0  Yalcin  0.656092 -0.754699       0.315983       -1.509398
1  Zeynep  1.206231  1.574916       0.244570        3.149832
2   Atlas -0.380152 -2.275399       1.513525       -4.550798

In [38]:
yeniIndexList=["Yal","Zey","Atl"]

In [40]:
yeniDataFrame["Yeni Index"]=yeniIndexList

In [42]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi Yeni Index
Yalcin  0.656092 -0.754699       0.315983       -1.509398        Yal
Zeynep  1.206231  1.574916       0.244570        3.149832        Zey
Atlas  -0.380152 -2.275399       1.513525       -4.550798        Atl

In [44]:
yeniDataFrame.set_index("Yeni Index") #index ataması

                Maas       Yas  Calisma Saati  Emeklilik Yasi
Yeni Index
Yal         0.656092 -0.754699       0.315983       -1.509398
Zey         1.206231  1.574916       0.244570        3.149832
Atl        -0.380152 -2.275399       1.513525       -4.550798

## Multi index

In [46]:
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [47]:
icindexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [52]:
birlesmisIndex=list(zip(ilkIndexler,icindexler)) #list(zip(...)) birleştirmeye yarar

In [53]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [54]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [51]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [58]:
benimListem=[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [59]:
benimListemDizi=np.array(BenimListem)

In [61]:
benimListemDF=pd.DataFrame(benimListem,index=birlesmisIndex,columns=["Yas","Meslek"])

In [62]:
benimListemDF

                    Yas Meslek
Simpson    Homer     40      A
           Bart      10      B
           Marge     30      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F

In [64]:
benimListemDF.loc["Simpson"]

       Yas Meslek
Homer   40      A
Bart    10      B
Marge   30      C

In [67]:
benimListemDF.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [68]:
benimListemDF.index.names=["Cizgi Film Adı","İsim"]

In [69]:
benimListemDF

                        Yas Meslek
Cizgi Film Adı İsim
Simpson        Homer     40      A
               Bart      10      B
               Marge     30      C
South Park     Cartman    9      D
               Kenny     10      E
               Kyle      11      F